# Tarea: Cuaderno de SQL para tareas entre pares

## Introducción
Con este cuaderno de Python, podrá:

1. Comprender el conjunto de datos Spacex
2. Cargar el conjunto de datos en la tabla correspondiente en una base de datos Db2
3. Ejecutar consultas SQL para responder preguntas de tareas

## Descripción general del conjunto de datos
SpaceX ha ganado atención mundial por una serie de hitos históricos.

Es la única empresa privada que ha logrado devolver una nave espacial desde la órbita baja terrestre, lo que logró por primera vez en diciembre de 2010. SpaceX anuncia lanzamientos de cohetes Falcon 9 en su sitio web con un costo de 62 millones de dólares, mientras que otros proveedores cuestan más de 165 millones de dólares cada uno; gran parte de los ahorros se deben a que Space X puede reutilizar la primera etapa.

Por lo tanto, si podemos determinar si la primera etapa aterrizará, podemos determinar el costo de un lanzamiento.

Esta información se puede utilizar si una empresa alternativa desea pujar contra SpaceX por un lanzamiento de cohete.

Este conjunto de datos incluye un registro de cada carga útil transportada durante una misión de SpaceX al espacio exterior.

### Descargar los conjuntos de datos

Esta tarea requiere que cargues el conjunto de datos de SpaceX.

En muchos casos, el conjunto de datos que se analizará está disponible como un archivo .CSV (valores separados por comas), quizás en Internet. Haz clic en el siguiente enlace para descargar y guardar el conjunto de datos (archivo .CSV):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Conjunto de datos de SpaceX</a>

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
%sql sqlite:///my_data1.db

In [4]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

Nota: El código a continuación se agrega para eliminar filas en blanco de la tabla.

In [5]:
%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

In [6]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

In [28]:
%sql PRAGMA table_info(SPACEXTBL);

 * sqlite:///my_data1.db
Done.

[(0, 'Date', 'TEXT', 0, None, 0),
 (1, 'Time (UTC)', 'TEXT', 0, None, 0),
 (2, 'Booster_Version', 'TEXT', 0, None, 0),
 (3, 'Launch_Site', 'TEXT', 0, None, 0),
 (4, 'Payload', 'TEXT', 0, None, 0),
 (5, 'PAYLOAD_MASS__KG_', 'INTEGER', 0, None, 0),
 (6, 'Orbit', 'TEXT', 0, None, 0),
 (7, 'Customer', 'TEXT', 0, None, 0),
 (8, 'Mission_Outcome', 'TEXT', 0, None, 0),
 (9, 'Landing_Outcome', 'TEXT', 0, None, 0)]

## Tareas
Ahora escriba y ejecute consultas SQL para resolver las tareas asignadas.

Nota: Si los nombres de las columnas están en mayúsculas y minúsculas, enciérrelos entre comillas dobles. Por ejemplo, "Landing_Outcome"

### Tarea 1
Muestra los nombres de los sitios de lanzamiento únicos en la misión espacial

In [12]:
%sql SELECT DISTINCT("Launch_site") FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### Tarea 2
Muestra 5 registros en los que los sitios de lanzamiento comiencen con la cadena 'CCA'

In [36]:
%sql SELECT "Launch_site" FROM SPACEXTBL WHERE Launch_site LIKE 'CCA%' LIMIT 5;
# De la forma anterior solo se filtra la columna seleccionada
# De la siguiente manera muestro la tabla aplicando ese filtro
%sql SELECT * FROM SPACEXTBL WHERE Launch_site LIKE 'CCA%' LIMIT 4;

 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Tarea 3
Mostrar la masa total de la carga útil transportada por los cohetes propulsores lanzados por la NASA (CRS)

In [38]:
%sql SELECT SUM(PAYLOAD_MASS__KG_) AS total_mass FROM SPACEXTBL WHERE Customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Tarea 4
Mostrar la masa promedio de la carga útil transportada por el cohete de refuerzo versión F9 v1.1

In [40]:
%sql SELECT AVG (PAYLOAD_MASS__KG_) AS AVG_mass FROM SPACEXTBL WHERE Booster_Version = 'F9 v1.1';

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Tarea 5
Indique la fecha en la que se logró el primer aterrizaje exitoso en una plataforma terrestre.
Sugerencia: utilice la función min

In [45]:
%sql SELECT MIN(DATE) AS FIRS_DATE FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[('2010-06-04',)]

### Tarea 6
Enumere los nombres de los propulsores que han tenido éxito en los aviones no tripulados y que tienen una masa de carga útil mayor a 4000 pero menor a 6000

In [47]:
%sql SELECT Booster_Version, Landing_Outcome FROM SPACEXTBL WHERE PAYLOAD_MASS__KG_ > 4000 AND PAYLOAD_MASS__KG_ < 6000 AND Landing_Outcome = 'Success (drone ship)';

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 'Success (drone ship)'),
 ('F9 FT B1026', 'Success (drone ship)'),
 ('F9 FT  B1021.2', 'Success (drone ship)'),
 ('F9 FT  B1031.2', 'Success (drone ship)')]

### Tarea 7
Enumere el número total de resultados exitosos y fallidos de la misión

In [58]:
# Alternativa 1
%sql SELECT COUNT(CASE WHEN Mission_Outcome LIKE '%Success%' THEN 1 END) AS Count_Success, COUNT(CASE WHEN Mission_Outcome LIKE '%Failure%' THEN 1 END) AS Count_Failure FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[(100, 1)]

In [59]:
# alternativa 2
%sql SELECT (SELECT COUNT(*) FROM SPACEXTBL WHERE Mission_Outcome LIKE '%Success%') AS Count_Success, (SELECT COUNT(*) FROM SPACEXTBL WHERE Mission_Outcome LIKE '%Failure%') AS Count_Failure;

 * sqlite:///my_data1.db
Done.

[(100, 1)]

### Tarea 8
Enumere los nombres de las booster_versions que han transportado la masa máxima de carga útil. Utilice una subconsulta

In [61]:
%sql SELECT Booster_Version FROM SPACEXTBL WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Tarea 9
Enumere los registros que mostrarán los nombres de los meses, los resultados de aterrizaje fallidos en el dron, las versiones de los propulsores y el sitio de lanzamiento para los meses del año 2015.

Nota: SQLLite no admite nombres de meses. Por lo tanto, debe usar substr(Date, 6,2) como mes para obtener los meses y substr(Date,0,5)='2015' para el año.

In [64]:
%sql SELECT CASE WHEN substr(Date, 6, 2) = '01' THEN 'January' WHEN substr(Date, 6, 2) = '02' THEN 'February' WHEN substr(Date, 6, 2) = '03' THEN 'March' WHEN substr(Date, 6, 2) = '04' THEN 'April' WHEN substr(Date, 6, 2) = '05' THEN 'May' WHEN substr(Date, 6, 2) = '06' THEN 'June' WHEN substr(Date, 6, 2) = '07' THEN 'July' WHEN substr(Date, 6, 2) = '08' THEN 'August' WHEN substr(Date, 6, 2) = '09' THEN 'September' WHEN substr(Date, 6, 2) = '10' THEN 'October' WHEN substr(Date, 6, 2) = '11' THEN 'November' WHEN substr(Date, 6, 2) = '12' THEN 'December' END AS Month_Name, Booster_Version, Landing_Outcome, Launch_Site FROM SPACEXTBL WHERE substr(Date, 0, 5) = '2015' AND Landing_Outcome LIKE '%Failure (drone ship)%';

 * sqlite:///my_data1.db
Done.

[('January', 'F9 v1.1 B1012', 'Failure (drone ship)', 'CCAFS LC-40'),
 ('April', 'F9 v1.1 B1015', 'Failure (drone ship)', 'CCAFS LC-40')]

### Tarea 10
Clasifique la cantidad de resultados de aterrizaje (como fracaso (dron) o éxito (plataforma de tierra)) entre las fechas del 4 de junio de 2010 y el 20 de marzo de 2017, en orden descendente.

In [65]:
%sql SELECT Landing_Outcome, COUNT(*) AS Count_Landing_Outcome FROM SPACEXTBL WHERE Date BETWEEN '2010-06-04' AND '2017-03-20' GROUP BY Landing_Outcome ORDER BY Count_Landing_Outcome DESC;

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]

## Enlaces de referencia

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Laboratorio práctico: Patrones de cadenas, ordenación y agrupación</a>

* <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Laboratorio_práctico__Built-in_Functions.md.html?origin=www.coursera.org">Laboratorio práctico: Funciones integradas</a>

* <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Laboratorio práctico: Subconsultas y sentencias SELECT anidadas</a>

* <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Tutorial práctico: acceso a bases de datos con SQL magic</a>

* <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Laboratorio práctico: análisis de un conjunto de datos del mundo real</a>